src/Documents/уатВводОстатков/уатВводОстатков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>уатВводОстатков</name>
  <registerRecords>AccumulationRegister.уатОстаткиДСУПодотчетныхЛиц</registerRecords>
  <registerRecords>AccumulationRegister.уатОстаткиДС</registerRecords>
  <registerRecords>AccumulationRegister.уатРасходы</registerRecords>
  <registerRecords>AccumulationRegister.уатДоходы</registerRecords>
  <attributes>
    <name>ВидОперации</name>
    <comment>Вид операции</comment>
    <type>
      <types>EnumRef.уатВидыОперацийВводОстатков</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <comment>Подразделение организации</comment>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Доходы</name>
    <comment>(Общ)</comment>
    <attributes>
      <name>ДатаОтражения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяДоходов</name>
      <comment>(Общ)</comment>
      <type>
        <types>CatalogRef.уатСтатьиДоходов</types>
      </type>
    </attributes>
    <attributes>
      <name>Колонна</name>
      <type>
        <types>CatalogRef.уатКолонны</types>
      </type>
    </attributes>
    <attributes>
      <name>ТС</name>
      <type>
        <types>CatalogRef.уатТС</types>
      </type>
    </attributes>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>DocumentRef.уатЗаказГрузоотправителя</types>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектСтроительства</name>
      <type>
        <types>CatalogRef.уатОбъектыСтроительства</types>
      </type>
    </attributes>
    <attributes>
      <name>Маршрут</name>
      <comment>Маршрут</comment>
      <type>
        <types>CatalogRef.уатМаршруты</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидПеревозки</name>
      <type>
        <types>CatalogRef.уатВидыПеревозок</types>
      </type>
    </attributes>
    <attributes>
      <name>НаправлениеПеревозки</name>
      <type>
        <types>CatalogRef.уатНаправленияПеревозок</types>
      </type>
    </attributes>
    <attributes>
      <name>ПараметрВыработки</name>
      <type>
        <types>CatalogRef.уатПараметрыВыработки</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураУслуги</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <comment>Сумма в валюте регл. учета</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <comment>Ставка НДС</comment>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <comment>Сумма НДС в валюте регл. учета</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>УчитыватьНДС</name>
      <comment>Учитывать НДС</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаВключаетНДС</name>
      <comment>Сумма включает НДС</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьПодразделение</name>
      <comment>(Регл)</comment>
      <type>
        <types>CatalogRef.ПодразделенияОрганизаций</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Расходы</name>
    <comment>(Общ)</comment>
    <attributes>
      <name>ДатаОтражения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяРасходов</name>
      <comment>(Общ)</comment>
      <type>
        <types>CatalogRef.уатСтатьиРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>Колонна</name>
      <type>
        <types>CatalogRef.уатКолонны</types>
      </type>
    </attributes>
    <attributes>
      <name>ТС</name>
      <type>
        <types>CatalogRef.уатТС</types>
      </type>
    </attributes>
    <attributes>
      <name>Заказ</name>
      <comment>Заказ</comment>
      <type>
        <types>DocumentRef.уатЗаказГрузоотправителя</types>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектСтроительства</name>
      <type>
        <types>CatalogRef.уатОбъектыСтроительства</types>
      </type>
    </attributes>
    <attributes>
      <name>Маршрут</name>
      <comment>Маршрут</comment>
      <type>
        <types>CatalogRef.уатМаршруты</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидПеревозки</name>
      <type>
        <types>CatalogRef.уатВидыПеревозок</types>
      </type>
    </attributes>
    <attributes>
      <name>НаправлениеПеревозки</name>
      <type>
        <types>CatalogRef.уатНаправленияПеревозок</types>
      </type>
    </attributes>
    <attributes>
      <name>Затрата</name>
      <comment>Затрата</comment>
      <type>
        <types>CatalogRef.уатРаботыПоРемонту</types>
        <types>CatalogRef.уатСерииНоменклатуры</types>
        <types>CatalogRef.уатТС</types>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураУслуги</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <comment>Сумма в валюте регл. учета</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <comment>Ставка НДС</comment>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <comment>Сумма НДС в валюте регл. учета</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>УчитыватьНДС</name>
      <comment>Учитывать НДС</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаВключаетНДС</name>
      <comment>Сумма включает НДС</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьПодразделение</name>
      <comment>(Регл)</comment>
      <type>
        <types>CatalogRef.ПодразделенияОрганизаций</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОстаткиДС</name>
    <attributes>
      <name>ДатаОтражения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>БанковскийСчетКасса</name>
      <type>
        <types>CatalogRef.Кассы</types>
        <types>CatalogRef.БанковскиеСчета</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяДвиженияДенежныхСредств</name>
      <type>
        <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <comment>Сумма в валюте кассы / банк. счета</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОстаткиДСПодотчетныхЛиц</name>
    <attributes>
      <name>ДатаОтражения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПодотчетноеЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Enums/уатВидыОперацийВводОстатков/уатВидыОперацийВводОстатков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>уатВидыОперацийВводОстатков</name>
  <enumValues>
    <name>ОперативныеДоходы</name>
  </enumValues>
  <enumValues>
    <name>ОперативныеРасходы</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиДСПодотчетныхЛиц</name>
    <comment>Ввод остатков денежных средств у подотчетных лиц</comment>
  </enumValues>
  <enumValues>
    <name>ОстаткиДСВКассах</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиДСНаСчетах</name>
  </enumValues>
</mdclass:Enum>

src/Enums/уатФормыОплаты/уатФормыОплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>уатФормыОплаты</name>
  <comment>(Упр)</comment>
  <enumValues>
    <name>Наличные</name>
  </enumValues>
  <enumValues>
    <name>Безналичные</name>
  </enumValues>
  <enumValues>
    <name>ПлатежнаяКарта</name>
  </enumValues>
</mdclass:Enum>

src/Documents/уатВводОстатков/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
	
	Настройки.ПриПолученииСлужебныхРеквизитов = Ложь;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

// СтандартныеПодсистемы.Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	// необходима для подключения внешних ПФ
	Заглушка = Истина;
КонецПроцедуры

// Конец СтандартныеПодсистемы.Печать

// СтандартныеПодсистемы.УправлениеДоступом

// Позволяет переопределить ограничение, указанное в модуле менеджера объекта метаданных.
//
// Параметры:
//  Ограничение - Структура:
//    * Текст                             - Строка - ограничение доступа для пользователей.
//                                          Если пустая строка, значит, доступ разрешен.
//    * ТекстДляВнешнихПользователей      - Строка - ограничение доступа для внешних пользователей.
//                                          Если пустая строка, значит, доступ запрещен.
//    * ПоВладельцуБезЗаписиКлючейДоступа - Неопределено - определить автоматически.
//                                        - Булево - если Ложь, то всегда записывать ключи доступа,
//                                          если Истина, тогда не записывать ключи доступа,
//                                          а использовать ключи доступа владельца (требуется,
//                                          чтобы ограничение было строго по объекту-владельцу).
//   * ПоВладельцуБезЗаписиКлючейДоступаДляВнешнихПользователей - Неопределено, Булево - также
//                                          как у параметра ПоВладельцуБезЗаписиКлючейДоступа.
//
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)
	|	И ЗначениеРазрешено(Подразделение)";
	
	Ограничение.ТекстДляВнешнихПользователей = Ограничение.Текст;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Инициализирует таблицы значений, содержащие данные табличных частей документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, СтруктураДополнительныеСвойства) Экспорт
	Если ДокументСсылка.ВидОперации = Перечисления.уатВидыОперацийВводОстатков.ОперативныеДоходы ИЛИ ДокументСсылка.ВидОперации = Перечисления.уатВидыОперацийВводОстатков.ОперативныеРасходы Тогда
		ФормированиеТаблицыДоходовРасходов(ДокументСсылка, СтруктураДополнительныеСвойства);
	ИначеЕсли ДокументСсылка.ВидОперации = Перечисления.уатВидыОперацийВводОстатков.ОстаткиДСПодотчетныхЛиц Тогда
		ФормированиеТаблицыОстаткиДСПодотчетныхЛиц(ДокументСсылка, СтруктураДополнительныеСвойства);
	ИначеЕсли ДокументСсылка.ВидОперации = Перечисления.уатВидыОперацийВводОстатков.ОстаткиДСВКассах
		ИЛИ ДокументСсылка.ВидОперации = Перечисления.уатВидыОперацийВводОстатков.ОстаткиДСНаСчетах Тогда
		ФормированиеТаблицыОстаткиДС(ДокументСсылка, СтруктураДополнительныеСвойства);
	КонецЕсли;
КонецПроцедуры // ИнициализироватьДанныеДокумента()

// Процедура формирует таблицу остатков ДС у подотчетных лиц
//
Процедура ФормированиеТаблицыОстаткиДСПодотчетныхЛиц(ДокументСсылка, СтруктураДополнительныеСвойства)
	мЗапрос = Новый Запрос;
	мЗапрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	уатВводОстатковОстаткиДСПодотчетныхЛиц.ДатаОтражения КАК Период,
	|	уатВводОстатковОстаткиДСПодотчетныхЛиц.Ссылка КАК Регистратор,
	|	уатВводОстатковОстаткиДСПодотчетныхЛиц.Ссылка.Организация КАК Организация,
	|	уатВводОстатковОстаткиДСПодотчетныхЛиц.ПодотчетноеЛицо КАК ПодотчетноеЛицо,
	|	уатВводОстатковОстаткиДСПодотчетныхЛиц.Сумма КАК Сумма,
	|	0 КАК СуммаУпр,
	|	уатВводОстатковОстаткиДСПодотчетныхЛиц.Валюта
	|ИЗ
	|	Документ.уатВводОстатков.ОстаткиДСПодотчетныхЛиц КАК уатВводОстатковОстаткиДСПодотчетныхЛиц
	|ГДЕ
	|	уатВводОстатковОстаткиДСПодотчетныхЛиц.Ссылка = &Ссылка";
	мЗапрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	ТаблицаДокумента = мЗапрос.Выполнить().Выгрузить();
	
	Если уатОбщегоНазначенияТиповые.уатЕстьКонстанта("ВалютаУправленческогоУчета") Тогда 
		ВалютаУпр = Константы.ВалютаУправленческогоУчета.Получить();
	Иначе
		ВалютаУпр = Константы.ВалютаРегламентированногоУчета.Получить();
	КонецЕсли;
	
	Для Каждого ТекСтрока Из ТаблицаДокумента Цикл
		ТекСтрока.СуммаУпр = уатОбщегоНазначенияТиповые.ПересчитатьИзВалютыВВалюту(ТекСтрока.Сумма,
			ТекСтрока.Валюта, ВалютаУпр, ДокументСсылка.Дата, ДокументСсылка.Дата);
	КонецЦикла;
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаОстаткиДСУПодотчетныхЛиц", ТаблицаДокумента);
КонецПроцедуры

// Процедура формирует таблицу остатков ДС
//
Процедура ФормированиеТаблицыОстаткиДС(ДокументСсылка, СтруктураДополнительныеСвойства)
	мЗапрос = Новый Запрос;
	мЗапрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	уатВводОстатковОстаткиДС.ДатаОтражения КАК Период,
	|	уатВводОстатковОстаткиДС.Ссылка КАК Регистратор,
	|	уатВводОстатковОстаткиДС.Ссылка.Организация КАК Организация,
	|	уатВводОстатковОстаткиДС.БанковскийСчетКасса КАК БанковскийСчетКасса,
	|	уатВводОстатковОстаткиДС.Сумма КАК Сумма,
	|	0 КАК СуммаУпр,
	|	уатВводОстатковОстаткиДС.БанковскийСчетКасса.ВалютаДенежныхСредств КАК Валюта,
	|	ВЫБОР
	|		КОГДА уатВводОстатковОстаткиДС.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.уатВидыОперацийВводОстатков.ОстаткиДСВКассах)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.уатФормыОплаты.Наличные)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.уатФормыОплаты.Безналичные)
	|	КОНЕЦ КАК ВидДенежныхСредств,
	|	уатВводОстатковОстаткиДС.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств
	|ИЗ
	|	Документ.уатВводОстатков.ОстаткиДС КАК уатВводОстатковОстаткиДС
	|ГДЕ
	|	уатВводОстатковОстаткиДС.Ссылка = &Ссылка";
	мЗапрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	ТаблицаДокумента = мЗапрос.Выполнить().Выгрузить();
	
	Если уатОбщегоНазначенияТиповые.уатЕстьКонстанта("ВалютаУправленческогоУчета") Тогда 
		ВалютаУпр = Константы.ВалютаУправленческогоУчета.Получить();
	Иначе
		ВалютаУпр = Константы.ВалютаРегламентированногоУчета.Получить();
	КонецЕсли;
	
	Для Каждого ТекСтрока Из ТаблицаДокумента Цикл
		ТекСтрока.СуммаУпр = уатОбщегоНазначенияТиповые.ПересчитатьИзВалютыВВалюту(ТекСтрока.Сумма,
			ТекСтрока.Валюта, ВалютаУпр, ДокументСсылка.Дата, ДокументСсылка.Дата);
	КонецЦикла;
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаОстаткиДС", ТаблицаДокумента);
КонецПроцедуры

// Процедура формирует таблицу доходов/расходов
//
Процедура ФормированиеТаблицыДоходовРасходов(ДокументСсылка, СтруктураДополнительныеСвойства)
	мЗапрос = Новый Запрос;
	Если ДокументСсылка.ВидОперации = Перечисления.уатВидыОперацийВводОстатков.ОперативныеДоходы Тогда
		мЗапрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	уатВводОстатковДоходы.ДатаОтражения КАК Период,
		|	уатВводОстатковДоходы.Ссылка КАК Регистратор,
		|	уатВводОстатковДоходы.Ссылка.Организация КАК Организация,
		|	уатВводОстатковДоходы.Ссылка.Подразделение КАК Подразделение,
		|	уатВводОстатковДоходы.Колонна КАК Колонна,
		|	уатВводОстатковДоходы.ТС КАК ТС,
		|	уатВводОстатковДоходы.СтатьяДоходов,
		|	уатВводОстатковДоходы.Сумма КАК Сумма,
		|	уатВводОстатковДоходы.Сумма КАК СуммаРегл,
		|	уатВводОстатковДоходы.Сумма КАК СуммаУпр,
		|	уатВводОстатковДоходы.СуммаНДС,
		|	уатВводОстатковДоходы.СуммаНДС КАК СуммаНДСУпр,
		|	уатВводОстатковДоходы.УчитыватьНДС,
		|	уатВводОстатковДоходы.СуммаВключаетНДС,
		|	уатВводОстатковДоходы.Заказ,
		|	уатВводОстатковДоходы.Заказ.Ответственный КАК Менеджер,
		|	уатВводОстатковДоходы.Контрагент,
		|	уатВводОстатковДоходы.ОбъектСтроительства,
		|	уатВводОстатковДоходы.Маршрут,
		|	уатВводОстатковДоходы.ВидПеревозки,
		|	уатВводОстатковДоходы.НаправлениеПеревозки,
		|	уатВводОстатковДоходы.ПараметрВыработки,
		|	уатВводОстатковДоходы.НоменклатураУслуги,
		|	уатВводОстатковДоходы.Валюта
		|ИЗ
		|	Документ.уатВводОстатков.Доходы КАК уатВводОстатковДоходы
		|ГДЕ
		|	уатВводОстатковДоходы.Ссылка = &Ссылка";
	Иначе
		мЗапрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	уатВводОстатковРасходы.ДатаОтражения КАК Период,
		|	уатВводОстатковРасходы.Ссылка КАК Регистратор,
		|	уатВводОстатковРасходы.Ссылка.Организация КАК Организация,
		|	уатВводОстатковРасходы.Ссылка.Подразделение КАК Подразделение,
		|	уатВводОстатковРасходы.Колонна КАК Колонна,
		|	уатВводОстатковРасходы.ОбъектСтроительства КАК ОбъектСтроительства,
		|	уатВводОстатковРасходы.ТС КАК ТС,
		|	уатВводОстатковРасходы.СтатьяРасходов,
		|	уатВводОстатковРасходы.Сумма КАК Сумма,
		|	уатВводОстатковРасходы.Сумма КАК СуммаРегл,
		|	уатВводОстатковРасходы.Сумма КАК СуммаУпр,
		|	уатВводОстатковРасходы.СуммаНДС,
		|	уатВводОстатковРасходы.СуммаНДС КАК СуммаНДСУпр,
		|	уатВводОстатковРасходы.СуммаВключаетНДС,
		|	уатВводОстатковРасходы.УчитыватьНДС,
		|	уатВводОстатковРасходы.Заказ,
		|	уатВводОстатковРасходы.Заказ.Ответственный КАК Менеджер,
		|	уатВводОстатковРасходы.Контрагент,
		|	уатВводОстатковРасходы.Маршрут,
		|	уатВводОстатковРасходы.ВидПеревозки,
		|	уатВводОстатковРасходы.НаправлениеПеревозки,
		|	уатВводОстатковРасходы.Затрата,
		|	уатВводОстатковРасходы.НоменклатураУслуги,
		|	уатВводОстатковРасходы.Валюта
		|ИЗ
		|	Документ.уатВводОстатков.Расходы КАК уатВводОстатковРасходы
		|ГДЕ
		|	уатВводОстатковРасходы.Ссылка = &Ссылка";
	КонецЕсли;
	
	мЗапрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	ТаблицаДокумента = мЗапрос.Выполнить().Выгрузить();
	
	ВалютаРегл = Константы.ВалютаРегламентированногоУчета.Получить();
	Если уатОбщегоНазначенияТиповые.уатЕстьКонстанта("ВалютаУправленческогоУчета") Тогда 
		ВалютаУпр = Константы.ВалютаУправленческогоУчета.Получить();
	Иначе
		ВалютаУпр = ВалютаРегл;
	КонецЕсли;
	
	Для Каждого ТекСтрока Из ТаблицаДокумента Цикл
		СуммаВсего = ТекСтрока.Сумма + ?(ТекСтрока.УчитыватьНДС И НЕ ТекСтрока.СуммаВключаетНДС, ТекСтрока.СуммаНДС, 0);
		
		ТекСтрока.СуммаРегл = уатОбщегоНазначенияТиповые.ПересчитатьИзВалютыВВалюту(СуммаВсего,
			ТекСтрока.Валюта, ВалютаРегл, ДокументСсылка.Дата, ДокументСсылка.Дата);
		ТекСтрока.СуммаУпр = уатОбщегоНазначенияТиповые.ПересчитатьИзВалютыВВалюту(СуммаВсего,
			ТекСтрока.Валюта, ВалютаУпр, ДокументСсылка.Дата, ДокументСсылка.Дата);
		ТекСтрока.СуммаНДС = уатОбщегоНазначенияТиповые.ПересчитатьИзВалютыВВалюту(ТекСтрока.СуммаНДС,
			ТекСтрока.Валюта, ВалютаРегл, ДокументСсылка.Дата, ДокументСсылка.Дата);
		ТекСтрока.СуммаНДСУпр = уатОбщегоНазначенияТиповые.ПересчитатьИзВалютыВВалюту(ТекСтрока.СуммаНДСУпр,
			ТекСтрока.Валюта, ВалютаУпр, ДокументСсылка.Дата, ДокументСсылка.Дата);
	КонецЦикла;
	
	Если ДокументСсылка.ВидОперации = Перечисления.уатВидыОперацийВводОстатков.ОперативныеДоходы Тогда
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаДоходы", ТаблицаДокумента);
	Иначе
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасходы", ТаблицаДокумента);
	КонецЕсли;
КонецПроцедуры

// Выполняет контроль при проведении.
//
Процедура ВыполнитьКонтроль(ДокументСсылка, ДополнительныеСвойства, Отказ, УдалениеПроведения = Ложь) Экспорт
	
	Заглушка = Истина;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
